import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import '../data.dart';

class AnimePage extends StatelessWidget {
  static const routeName = '/anime';

  @override
  Widget build(BuildContext context) {
    var items = [
      Anime(
          'Ousamu Ranking',
          'assets/images/ousamu_ranking.jpg',
          'บอจจิ เจ้าชายรัชทายาทลำดับที่ 1 เด็กชายผู้เป็นใบ้ หูหนวก ไร้ฝีมือในการต่อสู้ แล้วยังได้รับการดูถูกจากคนรอบข้างและประชาชนว่าไม่เหมาะสมที่จะขึ้นเป็นราชา จนวันที่เขาได้รู้จักกับ คาเงะ เผ่าเงาที่เหลือรอดจากการสูญพันธุ์และสื่อสารกับบอจจิได้ บอจจิ มุ่งมั่นที่พัฒนาตัวเองให้สมกับเป็นว่าที่ราชาองค์ใหม่ ท่ามกลางปัญหาของราชวงศ์ที่ทวีความรุนแรงขึ้น',
          4.5,
          24,
          '01.mp4'),
      Anime(
          'Kumo Desu ga, Nani ka?',
          'assets/images/kumo_desu.jpg',
          'หลังศึกระหว่างจอมมารและผู้กล้า ทำให้เกิดผลกระทบต่อโลก แรงระเบิดได้สังหารสาวมัธมปลายผู้เคราะห์ร้าย ทำให้เธอกลับชาติมาเกิดในร่างแมงมุมในต่างภพ เธอต้องหนีจากแมงมุมตัวแม่และพวกพ้องที่กัดกินกันเอง แล้วยังต้องพบกับมอนสเตอร์อีกหลายสายพันธุ์ ที่ทำให้การเดินทางของแมงมุมตัวจ๊อย อ่อนประสบการณ์ ไม่ราบรื่น แต่ปรับตัวได้อย่างรวดเร็วในโลกใหม่นี้',
          4,
          12, '02.mp4'),
      Anime(
          'Jujutsu Kaisen',
          'assets/images/jujutsu.jpg',
          'อิตาโดริ ยูจิ นักเรียนมัธยมปลายที่มีสมรรถภาพร่างกายสูงแต่เลี่ยงกีฬามาอยู่กลุ่มเหนือธรรมชาติ หลังปู่ที่นอนป่วยในโรงพยาบาล ก่อนตายได้ฝากให้เขาคิดถึงการช่วยผู้อื่นและตายอย่างเหมาะสม เขาได้มาพัวพันกับ “วัตถุต้องสาป” ที่ทำให้สัตว์ประหลาดปรากฏตัว ยูจิ และกลืนนิ้วต้องสาปเข้าไปเพื่อช่วยเพื่อน แต่พลังคำสาปของนิ้วเทพอสูร เรียวเมนสุคุนะกลับไม่สามารถควบคุมร่างเขาได้ ทำให้กลุ่มสมาคมตั้งใจให้เขารวบรวมนิ้วต้องคำสาปของเทพอสูร โดยให้เขามาเรียนที่โรงเรียนในโตเกียว หวังให้เขารวบรวมนิ้วของสุคุนะทั้งหมดได้ครบ แล้วค่อยกำจัด ยูจิ ในภายหลัง',
          4.5,
          24, '02.mp4'),
      Anime(
          'Mushoku Tensei 2nd Season',
          'assets/images/mushoku.jpg',
          'หนุ่มว่างงานอายุ 34 ปีที่เกาะพ่อแม่กินไปวัน ๆ เมื่อพ่อแม่จากไป พี่น้องก็ทนไม่ไหวไล่ตะเพิดเขาออกจากบ้าน ขณะกำลังสิ้นหวังและนึกเสียใจ เขาก็ถูกรถบรรทุกชนตาย ทว่าเมื่อลืมตาตื่นขึ้นอีกครั้ง ก็พบว่าตัวเองเกิดใหม่ในโลกต่างมิติแห่งดาบและเวทมนตร์ !? แม้ช่วงแรกจะรู้สึกสับสน แต่เขาก็ตัดสินใจใช้ความรู้และประสบการณ์ที่หลงเหลือจากชาติที่แล้ว…เพื่อเริ่มชีวิตใหม่ให้เป็นผู้เป็นคน !',
          4.5,
          24, '02.mp4'),
      Anime(
          'My Hero Academia',
          'assets/images/myhero.jpg',
          'มิโดริยะ อิซึคุเป็นเด็กมัธยมต้นธรรมดาคนหนึ่งที่อยู่ในโลกของผู้คนที่ไม่ธรรมดา เพราะว่าโลกที่เขาอยู่นั้น 80% ของมนุษย์ล้วนมี "อัตลักษณ์" หรือว่าพลังเหนือธรรมชาติ ทว่าอิซึคุนั้นได้มีความฝันอยากเป็น "ฮีโร่" มาตั้งแต่เด็ก ถึงแม้เขาจะโดนเพื่อนล้อหรือรังแกเพราะเหตุผลที่เขาไร้อัตลักษณ์มาตั้งแต่เกิดก็ตาม แต่หลังจากเหตุการวิกฤติวันหนึ่งที่ดอิซึคุได้พยายามช่วยชีวิตเพื่อนสมัยเด็กของเขาไว้จาก "วิลเลิน" (ผู้ที่ใช้อัตลักษณ์ในทางที่ไม่ดี) นั้น ทำให้ฮีโร่อันดับ 1 ไอดอลของอิซึคุนาม ออลไมท์ ได้เห็นวีรกรรมของอิซึคุ เขาจึงได้ตัดสินใจมอบอัตลักษณ์ของตนแด่อิซึคุ นั่นก็คือ "วัน ฟอร์ ออล" เรื่องราวหลังจากนี้บอกเล่าประสบการณ์ใน "โรงเรียนมัธยมปลายยูเอ" ของมิโดริยะและอุปสรรคที่เขาต้องฟันฝ่าก่อนที่จะมาเป็นสุดยอดฮีโร่ด้วยความพยายามของเขาเอง',
          4.5,
          25, '02.mp4'),
      Anime(
          'Tensei shitara Slime Datta Ken 2nd Season Part 2 ',
          'assets/images/slime.jpg',
          'พาร์ท 2 เป็นครึ่งหลังของเกิดใหม่ทั้งทีก็เป็นสไลม์ไปซะแล้ว (ภาค2) เกิดใหม่ทั้งทีก็เป็นสไลม์ไปซะแล้ว มิคามิ ซาโตรุ หนุ่มโสด ไม่เคยมีแฟน วัย 37 ปี ถูกแทงตายเพราะช่วยเพื่อนจากคนร้าย เขาได้เกิดใหม่ในต่างโลกด้วยร่างของสไลม์ ได้พบมังกร เวรุโดร่า ผู้ถูกผนึกมาร่วม 3 ร้อยปีและรู้ว่าเขามาจากต่างโลก ด้วยความเบื่อหน่ายในชีวิตจึงยอมเป็นเพื่อนกับสไลม์ ตั้งชื่อให้เขา “ริมุรุ” และให้เขากลืนตนเข้าไปในร่าง ด้วย2 ความสามารถ “นักล่า” ที่ทำให้เขาสามารถชิงความสามารถของผู้ถูกกลืน และ “ปราชญ์ผู้ยิ่งใหญ่” ทำให้เขาเข้าใจเรื่องราวในโลกใหม่ ส่งผลให้เขาพัฒนาเป็นสไลม์ที่น่าเกรงขามต่อเหล่ามอนสเตอร์ทั่วไป จนกลายเป็นปีศาจที่ยิ่งใหญ่ในภายหลัง',
          5,
          12, '02.mp4'),
    ];

    void goDetail(Anime item) {
      Navigator.pushNamed(
        context,
        "/detail",
        arguments: item,
      );
    }


    return Scaffold(
    backgroundColor: Colors.grey.shade700,
    body: Padding(
      padding: const EdgeInsets.all(8.0),
      child: GridView.builder(
          gridDelegate: const SliverGridDelegateWithFixedCrossAxisCount(
            crossAxisCount: 3,
            childAspectRatio: 2 / 3,
            mainAxisSpacing: 20.0,
            crossAxisSpacing: 20.0,

          ),
        itemCount: items.length,
        itemBuilder: (BuildContext ctx, index){
            return GestureDetector(
              onTap: (){
                goDetail(items[index]);
              },
              child: Container(
                decoration: BoxDecoration(
                  boxShadow: [
                    BoxShadow(
                      color: Colors.white,
                      offset: const Offset(
                        3.0,
                        3.0,
                      ),
                      blurRadius: 10.0,
                      spreadRadius: 2.0,
                    ),
                  ],
                ),
                alignment: Alignment.center,
                child: Image.asset('${items[index].image}',fit: BoxFit.cover,),
              ),
            );
        },
      ),
    ),
    );
    }

}
